       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHALLENGE as "CHALLENGE".
       AUTHOR. JEFFREY SWAN.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.

       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
        01 WS-CIRCLE.
             05 WS-RADIUS PIC 9999V99999.
        01 WS-CONSTANTS.
             05 WS-PI PIC 9V99999 VALUE 3.14159.
        01 WS-RESULTS.
             05 WS-CIRCUM PIC 9999V99999.
             05 WS-AREA PIC 999999V99999.
        01 WS-DISPLAY.
             05 WS-DISPLAY-CIRCUM PIC ZZ99.99999.
             05 WS-DISPLAY-AREA PIC ZZZZ99.99999.

       PROCEDURE DIVISION.
       0100-CALCULATE-PI.

           DISPLAY "Enter the radius of the circle:".
           ACCEPT WS-RADIUS.
           COMPUTE WS-CIRCUM = 2 * WS-PI * WS-RADIUS.
           MOVE WS-CIRCUM TO WS-DISPLAY-CIRCUM.
           COMPUTE WS-AREA = WS-PI * WS-RADIUS * WS-RADIUS.
           MOVE WS-AREA TO WS-DISPLAY-AREA.
           DISPLAY "The circumpherence of the circle is ",
                   WS-DISPLAY-CIRCUM.
           DISPLAY "The area of the circle is ", WS-DISPLAY-AREA.

           STOP RUN.
